[
  {
    "id": 1,
    "title": "my mom found my spotify wrapped and now she knows i listened to taylor swift 247 times",
    "content": "guys im DEAD 💀 my mom saw my spotify wrapped and she keeps asking why i played love story 247 times like MOM its called EMOTIONAL SUPPORT MUSIC ok??? now she keeps humming it and doing this weird dance thing help",
    "created_at": "2025-07-03T10:30:00Z",
    "upvote_count": 47,
    "comments": [
      {
        "content": "LMAOOO my dad found mine and now he thinks im emo bc i had 500 hrs of my chemical romance 😭",
        "created_at": "2025-07-03T10:45:00Z"
      },
      {
        "content": "wait but your mom dancing to taylor swift sounds kinda wholesome ngl",
        "created_at": "2025-07-03T11:12:00Z"
      },
      {
        "content": "247 times is rookie numbers bestie i had shake it off on repeat for 3 months straight",
        "created_at": "2025-07-03T11:33:00Z"
      }
    ]
  },
  {
    "id": 2,
    "title": "accidentally called my teacher mom today",
    "content": "so i was half asleep in chemistry and when mrs peterson asked me a question i literally said 'idk mom' and the ENTIRE class went silent. she just looked at me and said 'well honey the answer is sodium chloride' and now everyone calls me mommy issues 🤡",
    "created_at": "2025-07-03T09:15:00Z",
    "upvote_count": 89,
    "comments": [
      {
        "content": "NOOOOO this is my worst nightmare 😭😭😭",
        "created_at": "2025-07-03T09:30:00Z"
      },
      {
        "content": "at least your teacher was cool about it lol mine would have detention me",
        "created_at": "2025-07-03T09:45:00Z"
      },
      {
        "content": "ok but mrs peterson sounds like the sweetest teacher ever tho",
        "created_at": "2025-07-03T10:02:00Z"
      },
      {
        "content": "i called my boss dad once at my summer job.... we dont talk about it",
        "created_at": "2025-07-03T10:15:00Z"
      }
    ]
  },
  {
    "id": 3,
    "title": "crush texted me at 2am asking for homework answers",
    "content": "yall... my crush who hasnt talked to me in 3 weeks just texted me at 2am asking for the math homework answers. do i respond???? like part of me wants to help but also??? sir you ignored me for 3 weeks and now you need me??? the audacity 😤",
    "created_at": "2025-07-03T08:45:00Z",
    "upvote_count": 62,
    "comments": [
      {
        "content": "DONT DO IT bestie you're worth more than homework answers",
        "created_at": "2025-07-03T09:00:00Z"
      },
      {
        "content": "send him the wrong answers 💀",
        "created_at": "2025-07-03T09:10:00Z"
      },
      {
        "content": "or respond at 2am tomorrow with 'who is this' LMAO",
        "created_at": "2025-07-03T09:22:00Z"
      },
      {
        "content": "nah fr tho if he only texts you for homework he aint it chief",
        "created_at": "2025-07-03T09:40:00Z"
      }
    ]
  },
  {
    "id": 4,
    "title": "walked into the wrong class and sat through 20 minutes before realizing",
    "content": "i cannot be the only one who has done this right?? walked into what i thought was english lit and the teacher was going on about photosynthesis and i was just nodding along thinking we were doing some deep metaphor analysis 💀 finally looked around and realized i was in biology",
    "created_at": "2025-07-03T07:30:00Z",
    "upvote_count": 34,
    "comments": [
      {
        "content": "BESTIE NOOO but honestly photosynthesis metaphors could be fire",
        "created_at": "2025-07-03T07:45:00Z"
      },
      {
        "content": "this is such a mood tho like sometimes i zone out so hard i forget what class im in",
        "created_at": "2025-07-03T08:00:00Z"
      },
      {
        "content": "did you stay for the whole class or did you sneak out??",
        "created_at": "2025-07-03T08:15:00Z"
      }
    ]
  },
  {
    "id": 5,
    "title": "parents think im dating my best friend (were both gay)",
    "content": "ok so me and my bestie hang out literally every day and my parents keep making these comments like 'when are you gonna ask her to prom' and 'you two are so cute together' like... mom dad... we're both gay 😭 we've told you this!! but they think its just a phase or something ughhh",
    "created_at": "2025-07-03T06:00:00Z",
    "upvote_count": 76,
    "comments": [
      {
        "content": "parents really be like 'is this your special friend' no janet we're GAY",
        "created_at": "2025-07-03T06:15:00Z"
      },
      {
        "content": "lol my mom still asks if my gf is my 'roommate' like ma'am we share a bed",
        "created_at": "2025-07-03T06:30:00Z"
      },
      {
        "content": "maybe get matching pride pins or something?? subtle but not subtle lol",
        "created_at": "2025-07-03T06:45:00Z"
      },
      {
        "content": "honestly having a gay bestie is the best thing ever tho you guys are lucky",
        "created_at": "2025-07-03T07:00:00Z"
      }
    ]
  },
  {
    "id": 6,
    "title": "ate lunch in the bathroom stall bc i had nowhere to sit",
    "content": "not my proudest moment but the cafeteria was packed and my usual table was taken and i literally just... went to the bathroom and ate my sandwich in a stall. is this rock bottom??? i think this is rock bottom lol",
    "created_at": "2025-07-02T12:30:00Z",
    "upvote_count": 23,
    "comments": [
      {
        "content": "noooo bestie you can sit with me and my friends anytime!! cafeteria politics are stupid",
        "created_at": "2025-07-02T12:45:00Z"
      },
      {
        "content": "honestly same energy as eating in your car but at least cars are cleaner 😭",
        "created_at": "2025-07-02T13:00:00Z"
      },
      {
        "content": "bathroom lunch club unite!! we've all been there dont worry",
        "created_at": "2025-07-02T13:15:00Z"
      }
    ]
  },
  {
    "id": 7,
    "title": "accidentally sent a thirst trap to my family group chat",
    "content": "guys i wanna disappear into the void 😭😭😭 i was trying to send a cute selfie to my friends and accidentally sent it to the family group chat with my grandma, aunts, uncles EVERYONE. my grandma responded with 'looking good sweetie' and my uncle just sent the crying laughing emoji i cannot",
    "created_at": "2025-07-02T20:15:00Z",
    "upvote_count": 112,
    "comments": [
      {
        "content": "GRANDMA SAID LOOKING GOOD SWEETIE IM DECEASED 💀💀💀",
        "created_at": "2025-07-02T20:30:00Z"
      },
      {
        "content": "this is why i have trust issues with group chats",
        "created_at": "2025-07-02T20:45:00Z"
      },
      {
        "content": "your grandma is a whole vibe tho supporting your confidence",
        "created_at": "2025-07-02T21:00:00Z"
      },
      {
        "content": "at least your family is supportive mine would have given me a 3 hour lecture about modesty",
        "created_at": "2025-07-02T21:15:00Z"
      }
    ]
  },
  {
    "id": 8,
    "title": "pretended to be sick so i could stay home and finish my essay",
    "content": "ok but like... is this even wrong?? i had a 10 page essay due and i was nowhere near done so i fake coughed this morning and my mom was like 'oh honey stay home' and now im actually being productive for once lol. guilt level: 6/10",
    "created_at": "2025-07-02T11:00:00Z",
    "upvote_count": 41,
    "comments": [
      {
        "content": "this is just called working smarter not harder bestie",
        "created_at": "2025-07-02T11:15:00Z"
      },
      {
        "content": "mental health days are real health days!! you needed the time",
        "created_at": "2025-07-02T11:30:00Z"
      },
      {
        "content": "i do this like once a month lol no regrets",
        "created_at": "2025-07-02T11:45:00Z"
      }
    ]
  },
  {
    "id": 9,
    "title": "realized i've been pronouncing 'epitome' wrong for 3 years",
    "content": "yall... i just found out its pronounced eh-PIT-oh-me not EPI-tome 😭 i've been saying it wrong in english class for 3 YEARS and no one corrected me. my teacher probably thinks im an idiot. why is english so hard",
    "created_at": "2025-07-02T14:20:00Z",
    "upvote_count": 28,
    "comments": [
      {
        "content": "WAIT ITS NOT EPI-TOME???? you just changed my life",
        "created_at": "2025-07-02T14:35:00Z"
      },
      {
        "content": "english is literally the worst language like why is colonel pronounced kernel???",
        "created_at": "2025-07-02T14:50:00Z"
      },
      {
        "content": "i pronounced debris as deb-RIS until i was 16 we all have these moments",
        "created_at": "2025-07-02T15:05:00Z"
      }
    ]
  },
  {
    "id": 10,
    "title": "my dog ate my actual homework and no one believes me",
    "content": "the ONE time the dog actually eats my homework is the one time i actually did it 😭 brought the chewed up pieces to school and my teacher looked at me like i was crazy. ma'am this is EVIDENCE. my dog literally ate my geometry proofs and now i look like im using the oldest excuse in the book",
    "created_at": "2025-07-02T16:45:00Z",
    "upvote_count": 55,
    "comments": [
      {
        "content": "the irony is KILLING me rn like this is straight out of a movie",
        "created_at": "2025-07-02T17:00:00Z"
      },
      {
        "content": "dogs have the worst timing i swear they know exactly when to cause chaos",
        "created_at": "2025-07-02T17:15:00Z"
      },
      {
        "content": "should have taken a video for proof lol but fr that sucks",
        "created_at": "2025-07-02T17:30:00Z"
      },
      {
        "content": "at least you tried to bring the evidence tho that shows you actually did it",
        "created_at": "2025-07-02T17:45:00Z"
      }
    ]
  }
]